https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html

In [2]:
import pandas
pd.__version__

'1.3.5'

To manually store data in a table, create a DataFrame.
A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.

In [7]:
titanic_passengers_dictionary = {
    "Name": [
        "Braund, Mr. Owen Harris",
        "Allen, Mr. William Henry",
        "Bonnell, Miss. Elizabeth",
    ],
    "Age": [22, 35, 58],
    "Sex": ["male", "male", "female"],
}

titanic_passengers_dataframe = pandas.DataFrame(titanic_passengers_dictionary)

When selecting a single column of a pandas DataFrame, the result is a pandas Series.

In [9]:
titanic_passengers_dataframe["Name"]

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [10]:
titanic_passengers_dataframe["Age"].max()

58

In [11]:
titanic_passengers_dataframe.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

We can also directly make a series.

In [13]:
guest_class = pd.Series([1, 2, 3], name="guest_class")
guest_class.max()

3